### Değişkeni İndekse İndeksi Değişkene Çevirmek

<font color='gray'>
    
**Kaynak**    
    
Udemy - (50 Saat) Python A-Z™: Veri Bilimi ve Machine Learning
    
*Bölüm 8 - Veri Ön İşleme - 249. Veri Standardizasyonu - Dönüşümü*
</font>

#### Problem

Datasetimiz içerisindeki indeksi columna, columnu indekse çevirmek istiyoruz.

### Çözüm

In [14]:
import seaborn as sns
df = sns. load_dataset('tips')

#### <font color=green>İndeksi değişkene dönüştürmek</font>

In [15]:
df.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

Buradaki 0,1,2,3,4 şeklinde devam eden indeksi bir değişkene çevirmek istediğimizi düşünelim.

In [16]:
df["yeni_degisken"] = df.index

In [17]:
df.head()

   total_bill   tip     sex smoker  day    time  size  yeni_degisken
0       16.99  1.01  Female     No  Sun  Dinner     2              0
1       10.34  1.66    Male     No  Sun  Dinner     3              1
2       21.01  3.50    Male     No  Sun  Dinner     3              2
3       23.68  3.31    Male     No  Sun  Dinner     2              3
4       24.59  3.61  Female     No  Sun  Dinner     4              4

#### <font color=green>Değişkeni indekse dönüştürmek</font>

Var olan bir değişkeni indeks olarak atamak istiyor olabiliriz.

In [18]:
df["yeni_degisken"] = df["yeni_degisken"] + 10  #farkı görelim diye böyle bir işlem yaptık.

In [19]:
df.head()

   total_bill   tip     sex smoker  day    time  size  yeni_degisken
0       16.99  1.01  Female     No  Sun  Dinner     2             10
1       10.34  1.66    Male     No  Sun  Dinner     3             11
2       21.01  3.50    Male     No  Sun  Dinner     3             12
3       23.68  3.31    Male     No  Sun  Dinner     2             13
4       24.59  3.61  Female     No  Sun  Dinner     4             14

In [20]:
df.index = df["yeni_degisken"]

In [21]:
df.index

Int64Index([ 10,  11,  12,  13,  14,  15,  16,  17,  18,  19,
            ...
            244, 245, 246, 247, 248, 249, 250, 251, 252, 253],
           dtype='int64', name='yeni_degisken', length=244)

In [22]:
df.head()

,total_bill,tip,sex,smoker,day,time,size,yeni_degisken
yeni_degisken,,,,,,,,
10,16.99,1.01,Female,No,Sun,Dinner,2,10
11,10.34,1.66,Male,No,Sun,Dinner,3,11
12,21.01,3.50,Male,No,Sun,Dinner,3,12
13,23.68,3.31,Male,No,Sun,Dinner,2,13
14,24.59,3.61,Female,No,Sun,Dinner,4,14